app/views/chat_rooms/index.html.erb

SELECT `users`.* FROM `users` INNER JOIN `chat_room_participants` ON `users`.`id` = `chat_room_participants`.`user_id` WHERE `chat_room_participants`.`chat_room_id` = 1 AND `users`.`id` != 101 ORDER BY `users`.`id` ASC LIMIT 1
---
        <div class="chat-room-item">
          <% other_user = room.users.where.not(id: current_user.id).first %>

SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_room_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT 1 AS one FROM `messages` WHERE `messages`.`chat_room_id` = 1 LIMIT 1
---
                <span class="user-name"><%= other_user.name %></span>
                <% if room.messages.any? %>
                  <span class="last-message">
                    <%= truncate(room.messages.last.content, length: 50) %>