app/views/microposts/_micropost.html.erb

  <div class="comments-section">
    <% if micropost.comments.any? %>
      <h4>Comments (<%= micropost.comments.count %>)</h4>
      <div class="comments">
        <%= render micropost.comments.where(parent_comment_id: nil) %>
---
SELECT 1 AS one FROM `comments` WHERE `comments`.`micropost_id` = 302 LIMIT 1
SELECT COUNT(*) FROM `comments` WHERE `comments`.`micropost_id` = 302
SELECT `comments`.* FROM `comments` WHERE `comments`.`micropost_id` = 302 AND `comments`.`parent_comment_id` IS NULL ORDER BY `comments`.`created_at` DESC