app/controllers/chat_rooms_controller.rb

SELECT `chat_rooms`.* FROM `chat_rooms` INNER JOIN `chat_room_participants` ON `chat_rooms`.`id` = `chat_room_participants`.`chat_room_id` WHERE `chat_room_participants`.`user_id` = 101
SELECT `users`.* FROM `users` INNER JOIN `chat_room_participants` ON `users`.`id` = `chat_room_participants`.`user_id` WHERE `chat_room_participants`.`chat_room_id` = 1 AND `users`.`id` != 101 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @chat_rooms = current_user.chat_rooms.includes(:users)

SELECT `chat_rooms`.* FROM `chat_rooms` WHERE `chat_rooms`.`id` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_room_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1
---
  def show
    @chat_room = ChatRoom.find(params[:id])
    @messages = @chat_room.messages.includes(:user)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
---
  def create
    @other_user = User.find(params[:user_id])

SELECT `chat_rooms`.* FROM `chat_rooms` INNER JOIN `chat_room_participants` ON `chat_room_participants`.`chat_room_id` = `chat_rooms`.`id` WHERE `chat_room_participants`.`user_id` IN (101, 11) GROUP BY `chat_rooms`.`id` HAVING (COUNT(DISTINCT chat_room_participants.user_id) = 2) ORDER BY `chat_rooms`.`id` ASC LIMIT 1
INSERT INTO `chat_room_participants` (`chat_room_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 101, '2025-03-12 06:47:43.272115', '2025-03-12 06:47:43.272115')
INSERT INTO `chat_rooms` (`name`, `created_at`, `updated_at`) VALUES (NULL, '2025-03-12 06:47:43.258314', '2025-03-12 06:47:43.258314')
INSERT INTO `chat_room_participants` (`chat_room_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 11, '2025-03-12 06:47:43.276678', '2025-03-12 06:47:43.276678')
---
  def find_or_create_chat_room(other_user)
    # Tìm chat room chung giữa current_user và other_user
    common_room = ChatRoom.joins(:chat_room_participants)
                         .where(chat_room_participants: { user_id: [current_user.id, other_user.id] })
                         .group('chat_rooms.id')
                         .having('COUNT(DISTINCT chat_room_participants.user_id) = 2')
                         .first

    return common_room if common_room

    # Nếu chưa có thì tạo mới
    ChatRoom.transaction do
      room = ChatRoom.create!
      room.chat_room_participants.create!(user: current_user)
      room.chat_room_participants.create!(user: other_user)