app/controllers/comments_controller.rb

  def create
    @comment = @micropost.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO `comments` (`content`, `user_id`, `micropost_id`, `parent_comment_id`, `created_at`, `updated_at`) VALUES ('hihi\r\n', 101, 301, NULL, '2025-03-11 09:19:39.555527', '2025-03-11 09:19:39.555527')

  def destroy
    @comment = @micropost.comments.find(params[:id])
    @comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`micropost_id` = 302 AND `comments`.`id` = 2 ORDER BY `comments`.`created_at` DESC LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1

    def find_micropost
      @micropost = Micropost.find(params[:micropost_id])
---
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 301 ORDER BY `microposts`.`created_at` DESC LIMIT 1

    def correct_user
      @comment = current_user.comments.find_by(id: params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 101 AND `comments`.`id` = 2 ORDER BY `comments`.`created_at` DESC LIMIT 1