app/controllers/messages_controller.rb

INSERT INTO `messages` (`chat_room_id`, `user_id`, `content`, `edited`, `edited_at`, `created_at`, `updated_at`) VALUES (1, 101, 'hihi', NULL, NULL, '2025-03-12 06:49:27.465671', '2025-03-12 06:49:27.465671')
---
  def create
    @message = @chat_room.messages.build(message_params)
    @message.user = current_user

    if @message.save

SELECT `chat_rooms`.* FROM `chat_rooms` WHERE `chat_rooms`.`id` = 1 LIMIT 1
---
  def set_chat_room
    @chat_room = ChatRoom.find(params[:chat_room_id])