app/controllers/reactions_controller.rb

UPDATE `reactions` SET `reactions`.`reaction_type` = 'heart', `reactions`.`updated_at` = '2025-03-12 03:49:49.543879' WHERE `reactions`.`id` = 5
INSERT INTO `reactions` (`user_id`, `reactable_type`, `reactable_id`, `reaction_type`, `created_at`, `updated_at`) VALUES (101, 'Comment', 25, 'heart', '2025-03-12 03:50:53.049179', '2025-03-12 03:50:53.049179')
---
  def create
    # Tìm reaction hiện tại của user (nếu có)
    @existing_reaction = @reactable.reactions.find_by(user: current_user)

    if @existing_reaction
      # Nếu reaction mới giống reaction cũ -> xóa reaction (unlike)
      if @existing_reaction.reaction_type == reaction_params[:reaction_type]
        @existing_reaction.destroy
      else
        # Nếu reaction mới khác reaction cũ -> cập nhật reaction
        @existing_reaction.update(reaction_params)
      end
    else
      # Nếu chưa có reaction nào -> tạo mới
      @reaction = @reactable.reactions.build(reaction_params)
      @reaction.user = current_user
      @reaction.save

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 24 ORDER BY `comments`.`created_at` DESC LIMIT 1
---
    def find_reactable
      @reactable = if params[:comment_id]
                    Comment.find(params[:comment_id])