app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 10 OFFSET 0
---
  def index
    @users = User.paginate(page: params[:page], per_page: 10)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 101
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 101 ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1
---
    def correct_user
      @user = User.find(params[:id])