app/models/user.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `remember_digest`, `admin`, `activation_digest`, `activated`, `activated_at`, `reset_digest`, `provider`, `uid`, `github_url`, `username`, `image`) VALUES ('Đỗ Quốc Bình', '21012040@st.phenikaa-uni.edu.vn', '2025-03-11 07:22:24.399177', '2025-03-11 07:22:24.399177', '$2a$12$I3HATIn6/Et/QNBaT4gUIO5MSUtvhYU4.04AYUdJgfdw9xQF4eWZO', NULL, NULL, '$2a$12$xYKPt4JwwzZz6WHl.aRGL.gLI.U4QgM5TBqCPT64dj003mEuqaDSW', TRUE, NULL, NULL, 'github', '96821644', 'https://github.com/quocbinh93', 'quocbinh93', 'https://avatars.githubusercontent.com/u/96821644?v=4')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'github' AND `users`.`uid` = '96821644' ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|